spirilis/rx210kit/iodefine.h
/***********************************************************************/
/*  													               */
/*      PROJECT NAME :  rx210strawman                                  */
/*      FILE         :  iodefine.h                                     */
/*      DESCRIPTION  :  Definition of I/O Registers                    */
/*      CPU SERIES   :  RX200                                          */
/*      CPU TYPE     :  RX210                                          */
/*  													               */
/*      This file is generated by e2studio.                        */
/*  													               */
/***********************************************************************/                                                        
                                                                         
/*                                                                              */
/* Device     : RX/RX200/RX210                                                  */
/* File Name  : iodefine.h                                                      */
/* Abstract   : Definition of I/O Register.                                     */
/* History    : V1.0B (2012-06-17)  [Hardware Manual Revision : 1.00]           */
/* Note       : This is a typical example.                                      */
/*                                                                              */
/*  Copyright(c) 2012 Renesas Electronics Corp.                                 */
/*                  And Renesas Solutions Corp. ,All Rights Reserved.           */
/*                                                                              */
/********************************************************************************/
/*                                                                              */
/*  DESCRIPTION : Definition of ICU Register                                    */
/*  CPU TYPE    : RX210                                                         */
/*                                                                              */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                    */
/*     The following IR, DTCE, IEN, IPR macro functions simplify usage.         */
/*     The bit access operation is "Bit_Name(interrupt source,name)".           */
/*     A part of the name can be omitted.                                       */
/*     for example :                                                            */
/*       IR(MTU0,TGIA0) = 0;     expands to :                                   */
/*         ICU.IR[114].BIT.IR = 0;                                              */
/*                                                                              */
/*       DTCE(ICU,IRQ0) = 1;     expands to :                                   */
/*         ICU.DTCER[64].BIT.DTCE = 1;                                          */
/*                                                                              */
/*       IEN(CMT0,CMI0) = 1;     expands to :                                   */
/*         ICU.IER[0x03].BIT.IEN4 = 1;                                          */
/*                                                                              */
/*       IPR(MTU1,TGIA1) = 2;    expands to :                                   */
/*       IPR(MTU1,TGI  ) = 2;    // TGIA1,TGIB1 share IPR level.                */
/*         ICU.IPR[121].BIT.IPR = 2;                                            */
/*                                                                              */
/*       IPR(SCI0,ERI0) = 3;     expands to :                                   */
/*       IPR(SCI0,    ) = 3;     // SCI0 uses single IPR for all sources.       */
/*         ICU.IPR[214].BIT.IPR = 3;                                            */
/*                                                                              */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                      */
/*     The number of vector is "(interrupt source, name)".                      */
/*     for example :                                                            */
/*       #pragma interrupt INT_IRQ0(vect=VECT(ICU,IRQ0))          expands to :  */
/*         #pragma interrupt INT_IRQ0(vect=64)                                  */
/*       #pragma interrupt INT_CMT0_CMI0(vect=VECT(CMT0,CMI0))    expands to :  */
/*         #pragma interrupt INT_CMT0_CMI0(vect=28)                             */
/*       #pragma interrupt INT_MTU0_TGIA0(vect=VECT(MTU0,TGIA0))  expands to :  */
/*         #pragma interrupt INT_MTU0_TGIA0(vect=114)                           */
/*                                                                              */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC of SYSTEM Register                          */
/*     The bit access operation is "MSTP(name)".                                */
/*     The name that can be used is a macro name defined with "iodefine.h".     */
/*     for example :                                                            */
/*       MSTP(TMR2) = 0;    // TMR2,TMR3,TMR23                    expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA4  = 0;                                      */
/*       MSTP(SCI0) = 0;    // SCI0,SMCI0                         expands to :  */
/*         SYSTEM.MSTPCRB.BIT.MSTPB31 = 0;                                      */
/*       MSTP(MTU4) = 0;    // MTU,MTU0,MTU1,MTU2,MTU3,MTU4,MTU5  expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA9  = 0;                                      */
/*       MSTP(CMT3) = 0;    // CMT2,CMT3                          expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA14 = 0;                                      */
/*                                                                              */
/********************************************************************************/
#ifndef __RX210IODEFINE_HEADER__
#define __RX210IODEFINE_HEADER__


#ifdef __RX_LITTLE_ENDIAN__		/*Little endian*/
struct st_bsc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char STSCLR:1;
			unsigned char :7;
		} BIT;
	} BERCLR;
	char           wk0[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IGAEN:1;
			unsigned char TOEN:1;
			unsigned char :6;
		} BIT;
	} BEREN;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IA:1;
			unsigned char TO:1;
			unsigned char :2;
			unsigned char MST:3;
			unsigned char :1;
		} BIT;
	} BERSR1;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short ADDR:13;
		} BIT;
	} BERSR2;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			unsigned short BPRA:2;
			unsigned short BPRO:2;
			unsigned short BPIB:2;
			unsigned short BPGB:2;
			unsigned short :2;
			unsigned short BPFB:2;
			unsigned short BPEB:2;
			unsigned short :2;
		} BIT;
	} BUSPRI;
	char           wk4[7408];
	union {
		unsigned short WORD;
		struct {
			unsigned short WRMOD:1;
			unsigned short :2;
			unsigned short EWENB:1;
			unsigned short :4;
			unsigned short PRENB:1;
			unsigned short PWENB:1;
			unsigned short :5;
			unsigned short PRMOD:1;
		} BIT;
	} CS0MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSPWWAIT:3;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSWWAIT:5;
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
		} BIT;
	} CS0WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSROFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long AWAIT:2;
			unsigned long :2;
			unsigned long RDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
		} BIT;
	} CS0WCR2;
	char           wk5[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short WRMOD:1;
			unsigned short :2;
			unsigned short EWENB:1;
			unsigned short :4;
			unsigned short PRENB:1;
			unsigned short PWENB:1;
			unsigned short :5;
			unsigned short PRMOD:1;
		} BIT;
	} CS1MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSPWWAIT:3;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSWWAIT:5;
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
		} BIT;
	} CS1WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSROFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long AWAIT:2;
			unsigned long :2;
			unsigned long RDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
		} BIT;
	} CS1WCR2;
	char           wk6[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short WRMOD:1;
			unsigned short :2;
			unsigned short EWENB:1;
			unsigned short :4;
			unsigned short PRENB:1;
			unsigned short PWENB:1;
			unsigned short :5;
			unsigned short PRMOD:1;
		} BIT;
	} CS2MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSPWWAIT:3;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSWWAIT:5;
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
		} BIT;
	} CS2WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSROFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long AWAIT:2;
			unsigned long :2;
			unsigned long RDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
		} BIT;
	} CS2WCR2;
	char           wk7[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short WRMOD:1;
			unsigned short :2;
			unsigned short EWENB:1;
			unsigned short :4;
			unsigned short PRENB:1;
			unsigned short PWENB:1;
			unsigned short :5;
			unsigned short PRMOD:1;
		} BIT;
	} CS3MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSPWWAIT:3;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSWWAIT:5;
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
		} BIT;
	} CS3WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long CSROFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long AWAIT:2;
			unsigned long :2;
			unsigned long RDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
		} BIT;
	} CS3WCR2;
	char           wk8[1990];
	union {
		unsigned short WORD;
		struct {
			unsigned short EXENB:1;
			unsigned short :3;
			unsigned short BSIZE:2;
			unsigned short :2;
			unsigned short EMODE:1;
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
		} BIT;
	} CS0CR;
	char           wk9[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short RRCV:4;
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
		} BIT;
	} CS0REC;
	char           wk10[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short EXENB:1;
			unsigned short :3;
			unsigned short BSIZE:2;
			unsigned short :2;
			unsigned short EMODE:1;
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
		} BIT;
	} CS1CR;
	char           wk11[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short RRCV:4;
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
		} BIT;
	} CS1REC;
	char           wk12[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short EXENB:1;
			unsigned short :3;
			unsigned short BSIZE:2;
			unsigned short :2;
			unsigned short EMODE:1;
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
		} BIT;
	} CS2CR;
	char           wk13[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short RRCV:4;
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
		} BIT;
	} CS2REC;
	char           wk14[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short EXENB:1;
			unsigned short :3;
			unsigned short BSIZE:2;
			unsigned short :2;
			unsigned short EMODE:1;
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
		} BIT;
	} CS3CR;
	char           wk15[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short RRCV:4;
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
		} BIT;
	} CS3REC;
	char           wk16[68];
	union {
		unsigned short WORD;
		struct {
			unsigned short RCVEN0:1;
			unsigned short RCVEN1:1;
			unsigned short RCVEN2:1;
			unsigned short RCVEN3:1;
			unsigned short RCVEN4:1;
			unsigned short RCVEN5:1;
			unsigned short RCVEN6:1;
			unsigned short RCVEN7:1;
			unsigned short RCVENM0:1;
			unsigned short RCVENM1:1;
			unsigned short RCVENM2:1;
			unsigned short RCVENM3:1;
			unsigned short RCVENM4:1;
			unsigned short RCVENM5:1;
			unsigned short RCVENM6:1;
			unsigned short RCVENM7:1;
		} BIT;
	} CSRECEN;
};

struct st_cac {
	union {
		unsigned char BYTE;
		struct {
			unsigned char CFME:1;
			unsigned char :7;
		} BIT;
	} CACR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CACREFE:1;
			unsigned char FMCS:3;
			unsigned char TCSS:2;
			unsigned char EDGES:2;
		} BIT;
	} CACR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char RPS:1;
			unsigned char RSCS:3;
			unsigned char RCDS:2;
			unsigned char DFS:2;
		} BIT;
	} CACR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char FERRIE:1;
			unsigned char MENDIE:1;
			unsigned char OVFIE:1;
			unsigned char :1;
			unsigned char FERRFCL:1;
			unsigned char MENDFCL:1;
			unsigned char OVFFCL:1;
			unsigned char :1;
		} BIT;
	} CAICR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char FERRF:1;
			unsigned char MENDF:1;
			unsigned char OVFF:1;
			unsigned char :5;
		} BIT;
	} CASTR;
	char           wk0[1];
	unsigned short CAULVR;
	unsigned short CALLVR;
	unsigned short CACNTBR;
};

struct st_cmpb {
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB0INI:1;
			unsigned char :3;
			unsigned char CPB1INI:1;
			unsigned char :3;
		} BIT;
	} CPBCNT1;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CPB0OUT:1;
			unsigned char :3;
			unsigned char CPB1OUT:1;
		} BIT;
	} CPBFLG;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB0INTEN:1;
			unsigned char CPB0INTEG:1;
			unsigned char CPB0INTPL:1;
			unsigned char :1;
			unsigned char CPB1INTEN:1;
			unsigned char CPB1INTEG:1;
			unsigned char CPB1INTPL:1;
			unsigned char :1;
		} BIT;
	} CPBINT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB0FEN:1;
			unsigned char :1;
			unsigned char CPB0F:2;
			unsigned char CPB1FEN:1;
			unsigned char :1;
			unsigned char CPB1F:2;
		} BIT;
	} CPBF;
};

struct st_cmt {
	union {
		unsigned short WORD;
		struct {
			unsigned short STR0:1;
			unsigned short STR1:1;
			unsigned short :14;
		} BIT;
	} CMSTR0;
	char           wk0[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short STR2:1;
			unsigned short STR3:1;
			unsigned short :14;
		} BIT;
	} CMSTR1;
};

struct st_cmt0 {
	union {
		unsigned short WORD;
		struct {
			unsigned short CKS:2;
			unsigned short :4;
			unsigned short CMIE:1;
			unsigned short :9;
		} BIT;
	} CMCR;
	unsigned short CMCNT;
	unsigned short CMCOR;
};

struct st_crc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char GPS:2;
			unsigned char LMS:1;
			unsigned char :4;
			unsigned char DORCLR:1;
		} BIT;
	} CRCCR;
	unsigned char  CRCDIR;
	unsigned short CRCDOR;
};

struct st_da {
	unsigned short DADR0;
	unsigned short DADR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char DAE:1;
			unsigned char DAOE0:1;
			unsigned char DAOE1:1;
		} BIT;
	} DACR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DPSEL:1;
		} BIT;
	} DADPR;
};

struct st_dmac {
	union {
		unsigned char BYTE;
		struct {
			unsigned char DMST:1;
			unsigned char :7;
		} BIT;
	} DMAST;
};

struct st_dmac0 {
	void          *DMSAR;
	void          *DMDAR;
	unsigned long  DMCRA;
	unsigned short DMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short DCTG:2;
			unsigned short :6;
			unsigned short SZ:2;
			unsigned short :2;
			unsigned short DTS:2;
			unsigned short MD:2;
		} BIT;
	} DMTMD;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DARIE:1;
			unsigned char SARIE:1;
			unsigned char RPTIE:1;
			unsigned char ESIE:1;
			unsigned char DTIE:1;
			unsigned char :3;
		} BIT;
	} DMINT;
	union {
		unsigned short WORD;
		struct {
			unsigned short DARA:5;
			unsigned short :1;
			unsigned short DM:2;
			unsigned short SARA:5;
			unsigned short :1;
			unsigned short SM:2;
		} BIT;
	} DMAMD;
	char           wk2[2];
	unsigned long  DMOFR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DTE:1;
			unsigned char :7;
		} BIT;
	} DMCNT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SWREQ:1;
			unsigned char :3;
			unsigned char CLRS:1;
			unsigned char :3;
		} BIT;
	} DMREQ;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ESIF:1;
			unsigned char :3;
			unsigned char DTIF:1;
			unsigned char :2;
			unsigned char ACT:1;
		} BIT;
	} DMSTS;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DISEL:1;
			unsigned char :7;
		} BIT;
	} DMCSL;
};

struct st_dmac1 {
	void          *DMSAR;
	void          *DMDAR;
	unsigned long  DMCRA;
	unsigned short DMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short DCTG:2;
			unsigned short :6;
			unsigned short SZ:2;
			unsigned short :2;
			unsigned short DTS:2;
			unsigned short MD:2;
		} BIT;
	} DMTMD;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DARIE:1;
			unsigned char SARIE:1;
			unsigned char RPTIE:1;
			unsigned char ESIE:1;
			unsigned char DTIE:1;
			unsigned char :3;
		} BIT;
	} DMINT;
	union {
		unsigned short WORD;
		struct {
			unsigned short DARA:5;
			unsigned short :1;
			unsigned short DM:2;
			unsigned short SARA:5;
			unsigned short :1;
			unsigned short SM:2;
		} BIT;
	} DMAMD;
	char           wk2[6];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DTE:1;
			unsigned char :7;
		} BIT;
	} DMCNT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SWREQ:1;
			unsigned char :3;
			unsigned char CLRS:1;
			unsigned char :3;
		} BIT;
	} DMREQ;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ESIF:1;
			unsigned char :3;
			unsigned char DTIF:1;
			unsigned char :2;
			unsigned char ACT:1;
		} BIT;
	} DMSTS;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DISEL:1;
			unsigned char :7;
		} BIT;
	} DMCSL;
};

struct st_doc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char OMS:2;
			unsigned char DCSEL:1;
			unsigned char :1;
			unsigned char DOPCIE:1;
			unsigned char DOPCF:1;
			unsigned char DOPCFCL:1;
			unsigned char :1;
		} BIT;
	} DOCR;
	char           wk0[1];
	unsigned short DODIR;
	unsigned short DODSR;
};

struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char RRS:1;
			unsigned char :3;
		} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SHORT:1;
			unsigned char :7;
		} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DTCST:1;
			unsigned char :7;
		} BIT;
	} DTCST;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short VECN:8;
			unsigned short :7;
			unsigned short ACT:1;
		} BIT;
	} DTCSTS;
};

struct st_elc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char ELCON:1;
		} BIT;
	} ELCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ELS:8;
		} BIT;
	} ELSR[30];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char MTU1MD:2;
			unsigned char MTU2MD:2;
			unsigned char MTU3MD:2;
		} BIT;
	} ELOPA;
	union {
		unsigned char BYTE;
		struct {
			unsigned char MTU4MD:2;
			unsigned char :6;
		} BIT;
	} ELOPB;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char CMT1MD:2;
			unsigned char :4;
		} BIT;
	} ELOPC;
	union {
		unsigned char BYTE;
		struct {
			unsigned char TMR0MD:2;
			unsigned char :2;
			unsigned char TMR2MD:2;
			unsigned char :2;
		} BIT;
	} ELOPD;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PGR0:1;
			unsigned char PGR1:1;
			unsigned char PGR2:1;
			unsigned char PGR3:1;
			unsigned char PGR4:1;
			unsigned char PGR5:1;
			unsigned char PGR6:1;
			unsigned char PGR7:1;
		} BIT;
	} PGR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PGR0:1;
			unsigned char PGR1:1;
			unsigned char PGR2:1;
			unsigned char PGR3:1;
			unsigned char PGR4:1;
			unsigned char PGR5:1;
			unsigned char PGR6:1;
			unsigned char PGR7:1;
		} BIT;
	} PGR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PGCI:2;
			unsigned char PGCOVE:1;
			unsigned char :1;
			unsigned char PGCO:3;
			unsigned char :1;
		} BIT;
	} PGC1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PGCI:2;
			unsigned char PGCOVE:1;
			unsigned char :1;
			unsigned char PGCO:3;
			unsigned char :1;
		} BIT;
	} PGC2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PDBF0:1;
			unsigned char PDBF1:1;
			unsigned char PDBF2:1;
			unsigned char PDBF3:1;
			unsigned char PDBF4:1;
			unsigned char PDBF5:1;
			unsigned char PDBF6:1;
			unsigned char PDBF7:1;
		} BIT;
	} PDBF1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PDBF0:1;
			unsigned char PDBF1:1;
			unsigned char PDBF2:1;
			unsigned char PDBF3:1;
			unsigned char PDBF4:1;
			unsigned char PDBF5:1;
			unsigned char PDBF6:1;
			unsigned char PDBF7:1;
		} BIT;
	} PDBF2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PSB:3;
			unsigned char PSP:2;
			unsigned char PSM:2;
			unsigned char :1;
		} BIT;
	} PEL0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PSB:3;
			unsigned char PSP:2;
			unsigned char PSM:2;
			unsigned char :1;
		} BIT;
	} PEL1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PSB:3;
			unsigned char PSP:2;
			unsigned char PSM:2;
			unsigned char :1;
		} BIT;
	} PEL2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PSB:3;
			unsigned char PSP:2;
			unsigned char PSM:2;
			unsigned char :1;
		} BIT;
	} PEL3;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SEG:1;
			unsigned char :5;
			unsigned char WE:1;
			unsigned char WI:1;
		} BIT;
	} ELSEGR;
};

