spirilis/rx210kit/iodefine.h
struct st_flash {
	union {
		unsigned char BYTE;
		struct {
			unsigned char FLWE:2;
			unsigned char :6;
		} BIT;
	} FWEPROR;
	char           wk0[7799147];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char FRDMD:1;
			unsigned char :3;
		} BIT;
	} FMODR;
	char           wk1[13];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DFLWPE:1;
			unsigned char DFLRPE:1;
			unsigned char :1;
			unsigned char DFLAE:1;
			unsigned char CMDLK:1;
			unsigned char :2;
			unsigned char ROMAE:1;
		} BIT;
	} FASTAT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DFLWPEIE:1;
			unsigned char DFLRPEIE:1;
			unsigned char :1;
			unsigned char DFLAEIE:1;
			unsigned char CMDLKIE:1;
			unsigned char :2;
			unsigned char ROMAEIE:1;
		} BIT;
	} FAEINT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char FRDYIE:1;
			unsigned char :7;
		} BIT;
	} FRDYIE;
	char           wk2[45];
	union {
		unsigned short WORD;
		struct {
			unsigned short DBRE00:1;
			unsigned short DBRE01:1;
			unsigned short DBRE02:1;
			unsigned short DBRE03:1;
			unsigned short :4;
			unsigned short KEY:8;
		} BIT;
	} DFLRE0;
	char           wk3[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short DBWE00:1;
			unsigned short DBWE01:1;
			unsigned short DBWE02:1;
			unsigned short DBWE03:1;
			unsigned short :4;
			unsigned short KEY:8;
		} BIT;
	} DFLWE0;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short FCRME:1;
			unsigned short :7;
			unsigned short KEY:8;
		} BIT;
	} FCURAME;
	char           wk5[15194];
	union {
		unsigned char BYTE;
		struct {
			unsigned char PRGSPD:1;
			unsigned char ERSSPD:1;
			unsigned char :1;
			unsigned char SUSRDY:1;
			unsigned char PRGERR:1;
			unsigned char ERSERR:1;
			unsigned char ILGLERR:1;
			unsigned char FRDY:1;
		} BIT;
	} FSTATR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char FLOCKST:1;
			unsigned char :2;
			unsigned char FCUERR:1;
		} BIT;
	} FSTATR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short FENTRY0:1;
			unsigned short :6;
			unsigned short FENTRYD:1;
			unsigned short FEKEY:8;
		} BIT;
	} FENTRYR;
	union {
		unsigned short WORD;
		struct {
			unsigned short FPROTCN:1;
			unsigned short :7;
			unsigned short FPKEY:8;
		} BIT;
	} FPROTR;
	union {
		unsigned short WORD;
		struct {
			unsigned short FRESET:1;
			unsigned short :7;
			unsigned short FRKEY:8;
		} BIT;
	} FRESETR;
	char           wk6[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short PCMDR:8;
			unsigned short CMDR:8;
		} BIT;
	} FCMDR;
	char           wk7[12];
	union {
		unsigned short WORD;
		struct {
			unsigned short ESUSPMD:1;
			unsigned short :15;
		} BIT;
	} FCPSR;
	union {
		unsigned short WORD;
		struct {
			unsigned short BCADR:11;
			unsigned short :4;
			unsigned short BCSIZE:1;
		} BIT;
	} DFLBCCNT;
	union {
		unsigned short WORD;
		struct {
			unsigned short PEERRST:8;
			unsigned short :8;
		} BIT;
	} FPESTAT;
	union {
		unsigned short WORD;
		struct {
			unsigned short BCST:1;
			unsigned short :15;
		} BIT;
	} DFLBCSTAT;
	char           wk8[24];
	union {
		unsigned short WORD;
		struct {
			unsigned short PCKA:8;
			unsigned short :8;
		} BIT;
	} PCKAR;
};

struct st_icu {
	union {
		unsigned char BYTE;
		struct {
			unsigned char IR:1;
			unsigned char :7;
		} BIT;
	} IR[250];
	char           wk0[6];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DTCE:1;
			unsigned char :7;
		} BIT;
	} DTCER[249];
	char           wk1[7];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IEN0:1;
			unsigned char IEN1:1;
			unsigned char IEN2:1;
			unsigned char IEN3:1;
			unsigned char IEN4:1;
			unsigned char IEN5:1;
			unsigned char IEN6:1;
			unsigned char IEN7:1;
		} BIT;
	} IER[32];
	char           wk2[192];
	union {
		unsigned char BYTE;
		struct {
			unsigned char SWINT:1;
			unsigned char :7;
		} BIT;
	} SWINTR;
	char           wk3[15];
	union {
		unsigned short WORD;
		struct {
			unsigned short FVCT:8;
			unsigned short :7;
			unsigned short FIEN:1;
		} BIT;
	} FIR;
	char           wk4[14];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IPR:4;
			unsigned char :4;
		} BIT;
	} IPR[250];
	char           wk5[6];
	unsigned char  DMRSR0;
	char           wk6[3];
	unsigned char  DMRSR1;
	char           wk7[3];
	unsigned char  DMRSR2;
	char           wk8[3];
	unsigned char  DMRSR3;
	char           wk9[243];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char IRQMD:2;
			unsigned char :4;
		} BIT;
	} IRQCR[8];
	char           wk10[8];
	union {
		unsigned char BYTE;
		struct {
			unsigned char FLTEN0:1;
			unsigned char FLTEN1:1;
			unsigned char FLTEN2:1;
			unsigned char FLTEN3:1;
			unsigned char FLTEN4:1;
			unsigned char FLTEN5:1;
			unsigned char FLTEN6:1;
			unsigned char FLTEN7:1;
		} BIT;
	} IRQFLTE0;
	char           wk11[3];
	union {
		unsigned short WORD;
		struct {
			unsigned short FCLKSEL0:2;
			unsigned short FCLKSEL1:2;
			unsigned short FCLKSEL2:2;
			unsigned short FCLKSEL3:2;
			unsigned short FCLKSEL4:2;
			unsigned short FCLKSEL5:2;
			unsigned short FCLKSEL6:2;
			unsigned short FCLKSEL7:2;
		} BIT;
	} IRQFLTC0;
	char           wk12[106];
	union {
		unsigned char BYTE;
		struct {
			unsigned char NMIST:1;
			unsigned char OSTST:1;
			unsigned char WDTST:1;
			unsigned char IWDTST:1;
			unsigned char LVD1ST:1;
			unsigned char LVD2ST:1;
			unsigned char :2;
		} BIT;
	} NMISR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char NMIEN:1;
			unsigned char OSTEN:1;
			unsigned char WDTEN:1;
			unsigned char IWDTEN:1;
			unsigned char LVD1EN:1;
			unsigned char LVD2EN:1;
			unsigned char :2;
		} BIT;
	} NMIER;
	union {
		unsigned char BYTE;
		struct {
			unsigned char NMICLR:1;
			unsigned char OSTCLR:1;
			unsigned char WDTCLR:1;
			unsigned char IWDTCLR:1;
			unsigned char LVD1CLR:1;
			unsigned char LVD2CLR:1;
			unsigned char :2;
		} BIT;
	} NMICLR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char NMIMD:1;
			unsigned char :4;
		} BIT;
	} NMICR;
	char           wk13[12];
	union {
		unsigned char BYTE;
		struct {
			unsigned char NFLTEN:1;
			unsigned char :7;
		} BIT;
	} NMIFLTE;
	char           wk14[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char NFCLKSEL:2;
			unsigned char :6;
		} BIT;
	} NMIFLTC;
};

