spirilis/rx210kit/iodefine.h
struct st_smci {
	union {
		unsigned char BYTE;
		struct {
			unsigned char CKS:2;
			unsigned char BCP:2;
			unsigned char PM:1;
			unsigned char PE:1;
			unsigned char BCLK:1;
			unsigned char GM:1;
		} BIT;
	} SMR;
	unsigned char  BRR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CKE:2;
			unsigned char TEIE:1;
			unsigned char MPIE:1;
			unsigned char RE:1;
			unsigned char TE:1;
			unsigned char RIE:1;
			unsigned char TIE:1;
		} BIT;
	} SCR;
	unsigned char  TDR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char MPBT:1;
			unsigned char MPB:1;
			unsigned char TEND:1;
			unsigned char PER:1;
			unsigned char ERS:1;
			unsigned char ORER:1;
			unsigned char :2;
		} BIT;
	} SSR;
	unsigned char  RDR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SMIF:1;
			unsigned char :1;
			unsigned char SINV:1;
			unsigned char SDIR:1;
			unsigned char :3;
			unsigned char BCP2:1;
		} BIT;
	} SCMR;
};

struct st_system {
	union {
		unsigned short WORD;
		struct {
			unsigned short MD:1;
			unsigned short :15;
		} BIT;
	} MDMONR;
	union {
		unsigned short WORD;
		struct {
			unsigned short IROM:1;
			unsigned short EXB:1;
			unsigned short :2;
			unsigned short BOTS:1;
			unsigned short UBTS:1;
			unsigned short :10;
		} BIT;
	} MDSR;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short ROME:1;
			unsigned short EXBE:1;
			unsigned short :6;
			unsigned short KEY:8;
		} BIT;
	} SYSCR0;
	union {
		unsigned short WORD;
		struct {
			unsigned short RAME:1;
			unsigned short :15;
		} BIT;
	} SYSCR1;
	char           wk1[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short:14;
			unsigned short OPE:1;
			unsigned short SSBY:1;
		} BIT;
	} SBYCR;
	char           wk2[2];
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long MSTPA4:1;
			unsigned long MSTPA5:1;
			unsigned long :3;
			unsigned long MSTPA9:1;
			unsigned long :4;
			unsigned long MSTPA14:1;
			unsigned long MSTPA15:1;
			unsigned long :1;
			unsigned long MSTPA17:1;
			unsigned long :1;
			unsigned long MSTPA19:1;
			unsigned long :4;
			unsigned long MSTPA24:1;
			unsigned long :2;
			unsigned long MSTPA27:1;
			unsigned long MSTPA28:1;
			unsigned long MSTPA29:1;
			unsigned long :1;
			unsigned long ACSE:1;
		} BIT;
	} MSTPCRA;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long MSTPB4:1;
			unsigned long :1;
			unsigned long MSTPB6:1;
			unsigned long :1;
			unsigned long MSTPB8:1;
			unsigned long MSTPB9:1;
			unsigned long MSTPB10:1;
			unsigned long :6;
			unsigned long MSTPB17:1;
			unsigned long :3;
			unsigned long MSTPB21:1;
			unsigned long :1;
			unsigned long MSTPB23:1;
			unsigned long :1;
			unsigned long MSTPB25:1;
			unsigned long MSTPB26:1;
			unsigned long :3;
			unsigned long MSTPB30:1;
			unsigned long MSTPB31:1;
		} BIT;
	} MSTPCRB;
	union {
		unsigned long LONG;
		struct {
			unsigned long MSTPC0:1;
			unsigned long :18;
			unsigned long MSTPC19:1;
			unsigned long :6;
			unsigned long MSTPC26:1;
			unsigned long MSTPC27:1;
			unsigned long :4;
		} BIT;
	} MSTPCRC;
	char           wk3[4];
	union {
		unsigned long LONG;
		struct {
			unsigned long PCKD:4;
			unsigned long :4;
			unsigned long PCKB:4;
			unsigned long :4;
			unsigned long BCK:4;
			unsigned long :3;
			unsigned long PSTOP1:1;
			unsigned long ICK:4;
			unsigned long FCK:4;
		} BIT;
	} SCKCR;
	char           wk4[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short CKSEL:3;
			unsigned short :5;
		} BIT;
	} SCKCR3;
	union {
		unsigned short WORD;
		struct {
			unsigned short PLIDIV:2;
			unsigned short :6;
			unsigned short STC:5;
			unsigned short :3;
		} BIT;
	} PLLCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PLLEN:1;
			unsigned char :7;
		} BIT;
	} PLLCR2;
	char           wk5[5];
	union {
		unsigned char BYTE;
		struct {
			unsigned char BCLKDIV:1;
			unsigned char :7;
		} BIT;
	} BCKCR;
	char           wk6[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char MOSTP:1;
			unsigned char :7;
		} BIT;
	} MOSCCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SOSTP:1;
			unsigned char :7;
		} BIT;
	} SOSCCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LCSTP:1;
			unsigned char :7;
		} BIT;
	} LOCOCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ILCSTP:1;
			unsigned char :7;
		} BIT;
	} ILOCOCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char HCSTP:1;
			unsigned char :7;
		} BIT;
	} HOCOCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char HCFRQ:2;
			unsigned char :6;
		} BIT;
	} HOCOCR2;
	char           wk7[8];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OSTDIE:1;
			unsigned char :6;
			unsigned char OSTDE:1;
		} BIT;
	} OSTDCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char OSTDF:1;
			unsigned char :7;
		} BIT;
	} OSTDSR;
	char           wk8[94];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OPCM:3;
			unsigned char :1;
			unsigned char OPCMTSF:1;
			unsigned char :3;
		} BIT;
	} OPCCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char RSTCKSEL:3;
			unsigned char :4;
			unsigned char RSTCKEN:1;
		} BIT;
	} RSTCKCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char MSTS:5;
			unsigned char :3;
		} BIT;
	} MOSCWTCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char SSTS:5;
			unsigned char :3;
		} BIT;
	} SOSCWTCR;
	char           wk9[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char PSTS:5;
			unsigned char :3;
		} BIT;
	} PLLWTCR;
	char           wk10[2];
	
	union {
		unsigned char BYTE;
		struct {
			unsigned char HSTS2:4;
			unsigned char :4;
		} BIT;
	} HOCOWTCR2;
	char           wk11[22];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IWDTRF:1;
			unsigned char WDTRF:1;
			unsigned char SWRF:1;
			unsigned char :5;
		} BIT;
	} RSTSR2;
	char           wk12[1];
	unsigned short SWRR;
	char           wk13[28];
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD1IDTSEL:2;
			unsigned char LVD1IRQSEL:1;
			unsigned char :5;
		} BIT;
	} LVD1CR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD1DET:1;
			unsigned char LVD1MON:1;
			unsigned char :6;
		} BIT;
	} LVD1SR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD2IDTSEL:2;
			unsigned char LVD2IRQSEL:1;
			unsigned char :5;
		} BIT;
	} LVD2CR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD2DET:1;
			unsigned char LVD2MON:1;
			unsigned char :6;
		} BIT;
	} LVD2SR;
	char           wk14[284];
        unsigned char VRCR;
	char           wk14_1[509];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRC0:1;
			unsigned short PRC1:1;
			unsigned short PCR2:1;
			unsigned short PRC3:1;
			unsigned short :4;
			unsigned short PRKEY:8;
		} BIT;
	} PRCR;
	char           wk15[48768];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char DEEPCUT1:1;
			unsigned char :4;
			unsigned char IOKEEP:1;
			unsigned char DPSBY:1;
		} BIT;
	} DPSBYCR;
	char           wk16[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DIRQ0E:1;
			unsigned char DIRQ1E:1;
			unsigned char DIRQ2E:1;
			unsigned char DIRQ3E:1;
			unsigned char DIRQ4E:1;
			unsigned char DIRQ5E:1;
			unsigned char DIRQ6E:1;
			unsigned char DIRQ7E:1;
		} BIT;
	} DPSIER0;
	char           wk17[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DLVD1IE:1;
			unsigned char DLVD2IE:1;
			unsigned char DRTCIIE:1;
			unsigned char DRTCAIE:1;
			unsigned char DNMIE:1;
			unsigned char DIICDIE:1;
			unsigned char DIICCIE:1;
			unsigned char :1;
		} BIT;
	} DPSIER2;
	char           wk18[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DIRQ0F:1;
			unsigned char DIRQ1F:1;
			unsigned char DIRQ2F:1;
			unsigned char DIRQ3F:1;
			unsigned char DIRQ4F:1;
			unsigned char DIRQ5F:1;
			unsigned char DIRQ6F:1;
			unsigned char DIRQ7F:1;
		} BIT;
	} DPSIFR0;
	char           wk19[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DLVD1IF:1;
			unsigned char DLVD2IF:1;
			unsigned char DRTCIIF:1;
			unsigned char DRTCAIF:1;
			unsigned char DNMIF:1;
			unsigned char DRIICDIF:1;
			unsigned char DRIICCIF:1;
			unsigned char :1;
		} BIT;
	} DPSIFR2;
	char           wk20[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DIRQ0EG:1;
			unsigned char DIRQ1EG:1;
			unsigned char DIRQ2EG:1;
			unsigned char DIRQ3EG:1;
			unsigned char DIRQ4EG:1;
			unsigned char DIRQ5EG:1;
			unsigned char DIRQ6EG:1;
			unsigned char DIRQ7EG:1;
		} BIT;
	} DPSIEGR0;
	char           wk21[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char DLVD1EG:1;
			unsigned char DLVD2EG:1;
			unsigned char :2;
			unsigned char DNMIEG:1;
			unsigned char DRIICDEG:1;
			unsigned char DRIICCEG:1;
			unsigned char :1;
		} BIT;
	} DPSIEGR2;
	char           wk22[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char SOFTCUT:3;
			unsigned char :5;
		} BIT;
	} FHSSBYCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char PORF:1;
			unsigned char LVD0RF:1;
			unsigned char LVD1RF:1;
			unsigned char LVD2RF:1;
			unsigned char :3;
			unsigned char DPSRSTF:1;
		} BIT;
	} RSTSR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CWSF:1;
			unsigned char :7;
		} BIT;
	} RSTSR1;
	char           wk23[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char MODRV:3;
			unsigned char MODRV2:2;
			unsigned char MOSEL:1;
			unsigned char :1;
		} BIT;
	} MOFCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char HOCOPCNT:1;
			unsigned char :7;
		} BIT;
	} HOCOPCR;
	char           wk24[2];
	union {
		unsigned char BYTE;
		struct {
			unsigned char EXVREFINP1:1;
			unsigned char EXVCCINP1:1;
			unsigned char EXVREFINP2:1;
			unsigned char EXVCCINP2:1;
			unsigned char :1;
			unsigned char LVD1E:1;
			unsigned char LVD2E:1;
			unsigned char :1;
		} BIT;
	} LVCMPCR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD1LVL:4;
			unsigned char LVD2LVL:4;
		} BIT;
	} LVDLVLR;
	char           wk25[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD1RIE:1;
			unsigned char LVD1DFDIS:1;
			unsigned char LVD1CMPE:1;
			unsigned char :1;
			unsigned char LVD1FSAMP:2;
			unsigned char LVD1RI:1;
			unsigned char LVD1RN:1;
		} BIT;
	} LVD1CR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char LVD2RIE:1;
			unsigned char LVD2DFDIS:1;
			unsigned char LVD2CMPE:1;
			unsigned char :1;
			unsigned char LVD2FSAMP:2;
			unsigned char LVD2RI:1;
			unsigned char LVD2RN:1;
		} BIT;
	} LVD2CR0;
	char           wk26[4];
	unsigned char  DPSBKR[32];
};

struct st_temps {
	union {
		unsigned char BYTE;
		struct {
			unsigned char PGAGAIN:2;
			unsigned char :4;
			unsigned char PGAEN:1;
			unsigned char TSEN:1;
		} BIT;
	} TSCR;
};

struct st_tmr0 {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CCLR:2;
			unsigned char OVIE:1;
			unsigned char CMIEA:1;
			unsigned char CMIEB:1;
		} BIT;
	} TCR;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OSA:2;
			unsigned char OSB:2;
			unsigned char :4;
		} BIT;
	} TCSR;
	char           wk1[1];
	unsigned char  TCORA;
	char           wk2[1];
	unsigned char  TCORB;
	char           wk3[1];
	unsigned char  TCNT;
	char           wk4[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char CKS:3;
			unsigned char CSS:2;
			unsigned char :2;
			unsigned char TMRIS:1;
		} BIT;
	} TCCR;
	char           wk5[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char TCS:1;
			unsigned char :7;
		} BIT;
	} TCSTR;
};

struct st_tmr1 {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CCLR:2;
			unsigned char OVIE:1;
			unsigned char CMIEA:1;
			unsigned char CMIEB:1;
		} BIT;
	} TCR;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char OSA:2;
			unsigned char OSB:2;
			unsigned char :4;
		} BIT;
	} TCSR;
	char           wk1[1];
	unsigned char  TCORA;
	char           wk2[1];
	unsigned char  TCORB;
	char           wk3[1];
	unsigned char  TCNT;
	char           wk4[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char CKS:3;
			unsigned char CSS:2;
			unsigned char :2;
			unsigned char TMRIS:1;
		} BIT;
	} TCCR;
};

struct st_tmr01 {
	unsigned short TCORA;
	unsigned short TCORB;
	unsigned short TCNT;
	unsigned short TCCR;
};

struct st_wdt {
	unsigned char  WDTRR;
	char           wk0[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short TOPS:2;
			unsigned short :2;
			unsigned short CKS:4;
			unsigned short RPES:2;
			unsigned short :2;
			unsigned short RPSS:2;
			unsigned short :2;
		} BIT;
	} WDTCR;
	union {
		unsigned short WORD;
		struct {
			unsigned short CNTVAL:14;
			unsigned short UNDFF:1;
			unsigned short REFEF:1;
		} BIT;
	} WDTSR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char RSTIRQS:1;
		} BIT;
	} WDTRCR;
};

#elif __RX_BIG_ENDIAN__		/*Big endian*/

struct st_bsc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char STSCLR:1;
		} BIT;
	} BERCLR;
	char           wk0[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char TOEN:1;
			unsigned char IGAEN:1;
		} BIT;
	} BEREN;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char MST:3;
			unsigned char :2;
			unsigned char TO:1;
			unsigned char IA:1;
		} BIT;
	} BERSR1;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			unsigned short ADDR:13;
		} BIT;
	} BERSR2;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			unsigned short :2;
			unsigned short BPEB:2;
			unsigned short BPFB:2;
			unsigned short :2;
			unsigned short BPGB:2;
			unsigned short BPIB:2;
			unsigned short BPRO:2;
			unsigned short BPRA:2;
		} BIT;
	} BUSPRI;
	char           wk4[7408];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRMOD:1;
			unsigned short :5;
			unsigned short PWENB:1;
			unsigned short PRENB:1;
			unsigned short :4;
			unsigned short EWENB:1;
			unsigned short :2;
			unsigned short WRMOD:1;
		} BIT;
	} CS0MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
			unsigned long CSWWAIT:5;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSPWWAIT:3;
		} BIT;
	} CS0WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long RDON:3;
			unsigned long :2;
			unsigned long AWAIT:2;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long CSROFF:3;
		} BIT;
	} CS0WCR2;
	char           wk5[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRMOD:1;
			unsigned short :5;
			unsigned short PWENB:1;
			unsigned short PRENB:1;
			unsigned short :4;
			unsigned short EWENB:1;
			unsigned short :2;
			unsigned short WRMOD:1;
		} BIT;
	} CS1MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
			unsigned long CSWWAIT:5;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSPWWAIT:3;
		} BIT;
	} CS1WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long RDON:3;
			unsigned long :2;
			unsigned long AWAIT:2;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long CSROFF:3;
		} BIT;
	} CS1WCR2;
	char           wk6[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRMOD:1;
			unsigned short :5;
			unsigned short PWENB:1;
			unsigned short PRENB:1;
			unsigned short :4;
			unsigned short EWENB:1;
			unsigned short :2;
			unsigned short WRMOD:1;
		} BIT;
	} CS2MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
			unsigned long CSWWAIT:5;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSPWWAIT:3;
		} BIT;
	} CS2WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long RDON:3;
			unsigned long :2;
			unsigned long AWAIT:2;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long CSROFF:3;
		} BIT;
	} CS2WCR2;
	char           wk7[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short PRMOD:1;
			unsigned short :5;
			unsigned short PWENB:1;
			unsigned short PRENB:1;
			unsigned short :4;
			unsigned short EWENB:1;
			unsigned short :2;
			unsigned short WRMOD:1;
		} BIT;
	} CS3MOD;
	union {
		unsigned long LONG;
		struct {
			unsigned long :3;
			unsigned long CSRWAIT:5;
			unsigned long :3;
			unsigned long CSWWAIT:5;
			unsigned long :5;
			unsigned long CSPRWAIT:3;
			unsigned long :5;
			unsigned long CSPWWAIT:3;
		} BIT;
	} CS3WCR1;
	union {
		unsigned long LONG;
		struct {
			unsigned long :1;
			unsigned long CSON:3;
			unsigned long :1;
			unsigned long WDON:3;
			unsigned long :1;
			unsigned long WRON:3;
			unsigned long :1;
			unsigned long RDON:3;
			unsigned long :2;
			unsigned long AWAIT:2;
			unsigned long :1;
			unsigned long WDOFF:3;
			unsigned long :1;
			unsigned long CSWOFF:3;
			unsigned long :1;
			unsigned long CSROFF:3;
		} BIT;
	} CS3WCR2;
	char           wk8[1990];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
			unsigned short EMODE:1;
			unsigned short :2;
			unsigned short BSIZE:2;
			unsigned short :3;
			unsigned short EXENB:1;
		} BIT;
	} CS0CR;
	char           wk9[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
			unsigned short RRCV:4;
		} BIT;
	} CS0REC;
	char           wk10[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
			unsigned short EMODE:1;
			unsigned short :2;
			unsigned short BSIZE:2;
			unsigned short :3;
			unsigned short EXENB:1;
		} BIT;
	} CS1CR;
	char           wk11[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
			unsigned short RRCV:4;
		} BIT;
	} CS1REC;
	char           wk12[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
			unsigned short EMODE:1;
			unsigned short :2;
			unsigned short BSIZE:2;
			unsigned short :3;
			unsigned short EXENB:1;
		} BIT;
	} CS2CR;
	char           wk13[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
			unsigned short RRCV:4;
		} BIT;
	} CS2REC;
	char           wk14[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short MPXEN:1;
			unsigned short :3;
			unsigned short EMODE:1;
			unsigned short :2;
			unsigned short BSIZE:2;
			unsigned short :3;
			unsigned short EXENB:1;
		} BIT;
	} CS3CR;
	char           wk15[6];
	union {
		unsigned short WORD;
		struct {
			unsigned short :4;
			unsigned short WRCV:4;
			unsigned short :4;
			unsigned short RRCV:4;
		} BIT;
	} CS3REC;
	char           wk16[68];
	union {
		unsigned short WORD;
		struct {
			unsigned short RCVENM7:1;
			unsigned short RCVENM6:1;
			unsigned short RCVENM5:1;
			unsigned short RCVENM4:1;
			unsigned short RCVENM3:1;
			unsigned short RCVENM2:1;
			unsigned short RCVENM1:1;
			unsigned short RCVENM0:1;
			unsigned short RCVEN7:1;
			unsigned short RCVEN6:1;
			unsigned short RCVEN5:1;
			unsigned short RCVEN4:1;
			unsigned short RCVEN3:1;
			unsigned short RCVEN2:1;
			unsigned short RCVEN1:1;
			unsigned short RCVEN0:1;
		} BIT;
	} CSRECEN;
};

struct st_cac {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char CFME:1;
		} BIT;
	} CACR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char EDGES:2;
			unsigned char TCSS:2;
			unsigned char FMCS:3;
			unsigned char CACREFE:1;
		} BIT;
	} CACR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DFS:2;
			unsigned char RCDS:2;
			unsigned char RSCS:3;
			unsigned char RPS:1;
		} BIT;
	} CACR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char OVFFCL:1;
			unsigned char MENDFCL:1;
			unsigned char FERRFCL:1;
			unsigned char :1;
			unsigned char OVFIE:1;
			unsigned char MENDIE:1;
			unsigned char FERRIE:1;
		} BIT;
	} CAICR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char OVFF:1;
			unsigned char MENDF:1;
			unsigned char FERRF:1;
		} BIT;
	} CASTR;
	char           wk0[1];
	unsigned short CAULVR;
	unsigned short CALLVR;
	unsigned short CACNTBR;
};

struct st_cmpb {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char CPB1INI:1;
			unsigned char :3;
			unsigned char CPB0INI:1;
		} BIT;
	} CPBCNT1;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB1OUT:1;
			unsigned char :3;
			unsigned char CPB0OUT:1;
		} BIT;
	} CPBFLG;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char CPB1INTPL:1;
			unsigned char CPB1INTEG:1;
			unsigned char CPB1INTEN:1;
			unsigned char :1;
			unsigned char CPB0INTPL:1;
			unsigned char CPB0INTEG:1;
			unsigned char CPB0INTEN:1;
		} BIT;
	} CPBINT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CPB1F:2;
			unsigned char :1;
			unsigned char CPB1FEN:1;
			unsigned char CPB0F:2;
			unsigned char :1;
			unsigned char CPB0FEN:1;
		} BIT;
	} CPBF;
};

struct st_cmt {
	union {
		unsigned short WORD;
		struct {
			unsigned short :14;
			unsigned short STR1:1;
			unsigned short STR0:1;
		} BIT;
	} CMSTR0;
	char           wk0[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short :14;
			unsigned short STR3:1;
			unsigned short STR2:1;
		} BIT;
	} CMSTR1;
};

struct st_cmt0 {
	union {
		unsigned short WORD;
		struct {
			unsigned short :9;
			unsigned short CMIE:1;
			unsigned short :4;
			unsigned short CKS:2;
		} BIT;
	} CMCR;
	unsigned short CMCNT;
	unsigned short CMCOR;
};

struct st_crc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char DORCLR:1;
			unsigned char :4;
			unsigned char LMS:1;
			unsigned char GPS:2;
		} BIT;
	} CRCCR;
	unsigned char  CRCDIR;
	unsigned short CRCDOR;
};

struct st_da {
	unsigned short DADR0;
	unsigned short DADR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DAOE1:1;
			unsigned char DAOE0:1;
			unsigned char DAE:1;
		} BIT;
	} DACR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char DPSEL:1;
		} BIT;
	} DADPR;
};

struct st_dmac {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DMST:1;
		} BIT;
	} DMAST;
};

